#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");

    cout << "Романюк ИПЗИ-18к. 49Б (Одновымерные масиви)" << endl;

    int  i1, i2, a;

    cout << "Введите возраст 1-го человека:" << endl;

    cin >> i1;

    cout << "Введите возраст 2-го человека:" << endl;

    cin >> i2;

    int n[] = { i1, i2 };

    if (n[0] <= 10)
    {

        cout << "Возраст 1-го человека 0-10. Их количество:"  << endl;

    }
    if (n[0] > 10, n[0] <= 20)
    {

        cout << "Возраст 1-го человека 11-20. Их количество: "  << endl;

    }
    else
    {

        cout << "Нету 1-го человека с возрастом 0-20!" << endl;

    }
    if (n[1] <= 10) {

        cout << "Возрасn 2-го человека 0-10. Их количество: "  << endl;

    }
    if (n[1] > 10, n[1] <= 20) 
    {

        cout << "Возраст 2-го человека 11-20. Их количество: " << i1 + i2 << endl;

    }
    else 
    {

        cout << "Нету 2-го человека с возрастом 0-20!" << i1 + i2 << endl;

    }
    if (n[1] <= 10, n[0] <= 10)
    {
    
        cout << "Возрасn 1-го и 2-го человека 0-10. Их общее количество: "<< n[1] + n[0] << endl;

    }
    if(n[1] > 10, n[1] <= 20, n[0] > 10, n[0] <= 20)
    {
    
        cout << "Возрасn 1-го и 2-го человека 0-10. Их общее количество: " << n[1] + n[0] << endl;

    }
    else
    {

        cout << "Возраст 1-го и 2-го людей не 0-20 " << endl;

    }
    return 0;

}
